Catalogs/ДолговыеОбязательства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>ДолговыеОбязательства</Name>
			<Comment>Трейд Софт</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВалютаДоговора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДолговогоОбязательства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыДолговыхОбязательств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кредитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецДоговор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецДолжник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецКонтрагент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецКредитор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецУслуга</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретАвтообзвона</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеконтактныеНомера</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Контрагенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидКонтрагента</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ВидыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидыКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Контрагент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Должник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кредитор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/РезультатыМероприятий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>РезультатыМероприятий</Name>
			<Comment>Трейд Софт</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ТипыМероприятий</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РезультатТелефонногоСоединения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РезультатыТелефонногоСоединения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УказатьКонтактноеЛицо</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрикрепитьФайл</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСледующегоМероприятия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыМероприятий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвязанныйДокумент</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСвязанныхДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФункцияДопРеквизитов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФункцииДополнительныхРеквизитов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонКомментария</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФункцииКомментариев</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаполнитьКомментарий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСотрудника</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФункцияВидимости</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФункцииСвойств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультативныйКонтакт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрикреплятьФайлВМероприятие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипФайла</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыПрикрепляемыхФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеПринимающее</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникПринимающий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСотрудникаПринимающего</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеПередающее</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникПередающий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСотрудникаПередающего</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрикреплятьАктПередачи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АнализируетсяБлокировщиком</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательное</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заголовок</Name>
							<Comment>Заголовок </Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>75</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Функция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФункцииСвойств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизитыОбъекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеСвойства</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заголовок</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>75</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательное</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизитыКА</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеСвойства</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заголовок</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>75</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательное</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ДолговыеОбязательства/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Должник") И Не Параметры.Должник.Пустая() Тогда
		Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[0].ПравоеЗначение = ПолучитьМассивДел(Параметры.Должник, Перечисления.ВидыКонтрагентов.Должник);
		Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[0].Использование = Истина;
	КонецЕсли;
КонецПроцедуры

 &НаСервере
Процедура ПриОткрытииНаСервере()
	// Получим непредопредленное значение с сервера
	ЭтаФорма.РольРКЦ = РольДоступна("РКЦ")
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивДел(Контрагент, ВидКонтрагента)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ДолговыеОбязательстваКонтрагенты.Ссылка
	                      |ИЗ
	                      |	Справочник.ДолговыеОбязательства.Контрагенты КАК ДолговыеОбязательстваКонтрагенты
	                      |ГДЕ
	                      |	ДолговыеОбязательстваКонтрагенты.Значение = &Значение
	                      |	И ДолговыеОбязательстваКонтрагенты.ВидКонтрагента = &ВидКонтрагента");
	Запрос.УстановитьПараметр("Значение", Контрагент);
	Запрос.УстановитьПараметр("ВидКонтрагента", ВидКонтрагента);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");	
КонецФункции

&НаКлиенте
Процедура ПозвонитьДолжнику(Команда)
	// Получить объект мероприятия
	Если ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.Список И Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		К = Элементы.Список.ТекущиеДанные.Ссылка;
		НоваяЗадача = ПолучитьФорму("Задача.Мероприятие.Форма.ФормаМероприятия", Новый Структура("Объект", К),,Новый УникальныйИдентификатор());
		НоваяЗадача.Объект.Объект = К;
		НоваяЗадача.Объект.ТипМероприятия = ПредопределенноеЗначение("Справочник.ТипыМероприятий.ТелефонныйЗвонокИсходящий");
		// НоваяЗадача.Объект.Контакт = РезультатНомер;
		//НоваяЗадача.КонтрагентКЛ = К;
		НоваяЗадача.Открыть();
	Иначе
		Предупреждение("Не выбран объект мероприятия!",,"Исходящий звонок");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОтправитьСМСНаСервере()
	// Получим непредопределенное значение с сервера
	ЭтаФорма.РезультатОтправлено = Справочники.РезультатыМероприятий.НайтиПоНаименованию("Отправлено");
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСМС(Команда)
	ОтправитьСМСНаСервере();
	// Выполняем обычную клиентскую процедуру
	Если ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.Список И Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		К = Элементы.Список.ТекущиеДанные.Ссылка;
		НоваяЗадача = ПолучитьФорму("Задача.Мероприятие.Форма.ФормаМероприятия", Новый Структура("Объект", К),,Новый УникальныйИдентификатор());
		НоваяЗадача.Объект.Объект = К;
		НоваяЗадача.Объект.ТипМероприятия = ПредопределенноеЗначение("Справочник.ТипыМероприятий.ОтправкаСМС");
		НоваяЗадача.Объект.Результат = РезультатОтправлено;
		// НоваяЗадача.Объект.Контакт = РезультатНомер;
		//НоваяЗадача.КонтрагентКЛ = К;
		НоваяЗадача.Открыть();
	Иначе
		Предупреждение("Не выбран объект мероприятия!",,"Отправка СМС");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура НаписатьВВЦНаСервере()
	// Получим непредопределенное значение с сервера
 	ЭтаФорма.ТипВЦ = Справочники.ТипыМероприятий.НайтиПоНаименованию("WhatsApp");
	ЭтаФорма.РезультатОтправлено = Справочники.РезультатыМероприятий.НайтиПоНаименованию("Отправлено");
КонецПроцедуры

&НаКлиенте
Процедура НаписатьВВЦ(Команда)
	НаписатьВВЦНаСервере();
	// Выполняем обычную клиентскую процедуру
	Если ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.Список И Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		К = Элементы.Список.ТекущиеДанные.Ссылка;
		НоваяЗадача = ПолучитьФорму("Задача.Мероприятие.Форма.ФормаМероприятия", Новый Структура("Объект", К),,Новый УникальныйИдентификатор());
		НоваяЗадача.Объект.Объект = К;
		НоваяЗадача.Объект.ТипМероприятия = ТипВЦ;
		НоваяЗадача.Объект.Результат = РезультатОтправлено; 
		// НоваяЗадача.Объект.Контакт = РезультатНомер;
		//НоваяЗадача.КонтрагентКЛ = К;
		НоваяЗадача.Открыть();
	Иначе
		Предупреждение("Не выбран объект мероприятия!",,"Интеграция с WhatsApp");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗакрепитьДолжникаНаСервере()
	// Получим непредопределенное значение с сервера
 	ЭтаФорма.ТипЗаявка = Справочники.ТипыМероприятий.НайтиПоНаименованию("Заявка на закрепление");
КонецПроцедуры

&НаКлиенте
Процедура ЗакрепитьДолжника(Команда)
	ЗакрепитьДолжникаНаСервере();
	// Выполняем обычную клиентскую процедуру
	Если ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.Список И Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		К = Элементы.Список.ТекущиеДанные.Ссылка;
		НоваяЗадача = ПолучитьФорму("Задача.Мероприятие.Форма.ФормаМероприятия", Новый Структура("Объект", К),,Новый УникальныйИдентификатор());
		НоваяЗадача.Объект.Объект = К;
		НоваяЗадача.Объект.ТипМероприятия = ТипЗаявка;
		// НоваяЗадача.Объект.Контакт = РезультатНомер;
		//НоваяЗадача.КонтрагентКЛ = К;
		НоваяЗадача.Открыть();
	Иначе
		Предупреждение("Не выбран объект мероприятия!",,"Открепление должника");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДолжникМероприятия(Команда)
	// Передать с ключом
	Если ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.Список И Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		К = Элементы.Список.ТекущиеДанные.Ссылка;
		ФормаМероприятия = ПолучитьФорму("Задача.Мероприятие.Форма.ФормаСписка",,,Новый УникальныйИдентификатор());
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ФормаМероприятия.Список, "Объект", К, ВидСравненияКомпоновкиДанных.Равно, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный, );
		ФормаМероприятия.КоманднаяПанель.Видимость = Ложь;
		ФормаМероприятия.ОткрытьМодально();
	Иначе
		Предупреждение("Не найден объект отбора!",,"Все мероприятия");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоискНомераВБазе(Команда)
	ФормаПоиска = ПолучитьФорму("ОбщаяФорма.ПоискНомераВБазе",,,Новый УникальныйИдентификатор());
	ФормаПоиска.Открыть();
КонецПроцедуры

&НаСервере
Процедура ЗапросКредиторуНаСервере()
	// Получим непредопределенное значение с сервера
 	ЭтаФорма.ТипЗапросКредитору = Справочники.ТипыМероприятий.НайтиПоНаименованию("Запрос кредитору");
КонецПроцедуры

&НаКлиенте
Процедура ЗапросКредитору(Команда)
	Если ЭтаФорма.РольРКЦ = Истина Тогда
		ЗапросКредиторуНаСервере();
		// Выполняем обычную клиентскую процедуру
		Если ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.Список И Элементы.Список.ТекущиеДанные <> Неопределено Тогда
			К = Элементы.Список.ТекущиеДанные.Ссылка;
			НоваяЗадача = ПолучитьФорму("Задача.Мероприятие.Форма.ФормаМероприятия", Новый Структура("Объект", К),,Новый УникальныйИдентификатор());
			НоваяЗадача.Объект.Объект = К;
			НоваяЗадача.Объект.ТипМероприятия = ТипЗапросКредитору; 
			// НоваяЗадача.Объект.Контакт = РезультатНомер;
			//НоваяЗадача.КонтрагентКЛ = К;
			НоваяЗадача.Открыть();
		Иначе
			Предупреждение("Не выбран объект мероприятия!",,"Запрос кредитору");
		КонецЕсли;
	Иначе
		Предупреждение("Нарушение прав доступа!",,"Предупреждение");
	КонецЕсли;
КонецПроцедуры
